app/controllers/api/v1/seeking_profiles_controller.rb

UPDATE "seeking_profiles" SET "maxSeekDistance" = $1, "updated_at" = $2 WHERE "seeking_profiles"."id" = $3  [["maxSeekDistance", 60], ["updated_at", "2016-08-20 22:28:53.190572"], ["id", 5]]
---
	def update
    user = current_user
    if user.SeekingProfile.update(seekingprofile_params)