app/controllers/api/v1/sessions_controller.rb

	def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = user_email.present? && User.find_by(email: user_email)

    if user.valid_password? user_password
      sign_in user, store: false
      user.generate_authentication_token!
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "ryancwong@gmail.com"]]
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["last_sign_in_at", "2016-07-07 11:05:55.723965"], ["current_sign_in_at", "2016-07-07 11:15:58.655489"], ["sign_in_count", 3], ["updated_at", "2016-07-07 11:15:58.656569"], ["id", 16]]

  def destroy
    user = User.find_by(auth_token: params[:id])
    user.generate_authentication_token!
    user.save
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT 1  [["auth_token", "16"]]
UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", "cjkKnc5PJzz-f_4jWvB_"], ["updated_at", "2016-07-07 11:19:15.518164"], ["id", 16]]