app/controllers/api/v1/users_controller.rb

  def update_seekingprofile
    user = current_user
    if user.SeekingProfile.update(seekingprofile_params)
---
UPDATE "seeking_profiles" SET "minSeekDistance" = $1, "maxSeekDistance" = $2, "updated_at" = $3 WHERE "seeking_profiles"."id" = $4  [["minSeekDistance", 20], ["maxSeekDistance", 40], ["updated_at", "2016-08-20 20:19:36.137052"], ["id", 5]]