app/controllers/api/v1/users_controller.rb

  def show
    respond_with User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def update
  	# using the current_user method in autheticable.rb, get user by session token
    user = current_user
    if user.update(user_params)
---
UPDATE "users" SET "latitude" = $1, "longitude" = $2 WHERE "users"."id" = $3  [["latitude", "49.0"], ["longitude", "-123.0"], ["id", 14]]

  def get_filtered_users
    user = current_user
    user.update(user_params)
    user.SeekingProfile.update(params.require(:user).permit(:seekingprofile_attributes => [:maxSeekDistance, :minSeekDistance]))
    distance = user.SeekingProfile.maxSeekDistance - user.SeekingProfile.minSeekDistance
    @users = User.within(distance, :units => :miles, :origin => [user.latitude, user.longitude]).by_distance(:origin => [user.latitude, user.longitude]).where.not(facebook_id: user.facebook_id)
---
UPDATE "users" SET "latitude" = $1, "longitude" = $2 WHERE "users"."id" = $3  [["latitude", "51.5"], ["longitude", "-0.128"], ["id", 0]]
UPDATE "seeking_profiles" SET "maxSeekDistance" = $1, "minSeekDistance" = $2, "updated_at" = $3 WHERE "seeking_profiles"."id" = $4  [["maxSeekDistance", nil], ["minSeekDistance", nil], ["updated_at", "2016-08-21 00:55:40.929557"], ["id", 4]]
SELECT  "seeking_profiles".* FROM "seeking_profiles" WHERE "seeking_profiles"."user_id" = $1 LIMIT 1  [["user_id", 0]]
SELECT "users".* FROM "users" WHERE ((